# Lec05: Pandas

In [1]:
import pandas as pd

In [ ]:
# # input_file은 불러오려는 CSV 파일의 경로
# data_frame = pd.read_csv(input_file)

# # input_file은 불려오려는 EXCEL 파일의 경로
# data_frame = pd.read_excel(input_file, sheetname, header)

In [3]:
raw_data = { 'col0' : [1, 2, 3, 4],
            'col1' : [5, 6, 7, 8],
            'col2' : [9, 10, 11, 12]}

data_frame = pd.DataFrame(raw_data)

In [4]:
print(data_frame)

   col0  col1  col2
0     1     5     9
1     2     6    10
2     3     7    11
3     4     8    12

In [5]:
data_frame = pd.DataFrame([
    [1, 2, 3],
    [4, 5 ,6],
    [7, 8, 9],
])

In [6]:
print(data_frame)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [9]:
#output_file은 출력하려는 CSV 파일의 경로
data_frame.to_csv('output_file', sep = ',', index=False)

In [10]:
dat = pd.Series([1,3,6,12])
dat

0     1
1     3
2     6
3    12
dtype: int64

In [11]:
dat.values

array([ 1,  3,  6, 12], dtype=int64)

In [15]:
import numpy as np
dat2 = pd.Series(np.array([1,3,np.nan,12]))
dat3 = pd.Series(['aa', 'bb', 'c', 'd'])
dat4 = pd.Series([1, 'aa', 2.34, 'd'])
print(dat2, dat3, dat4)

0     1.0
1     3.0
2     NaN
3    12.0
dtype: float64 0    aa
1    bb
2     c
3     d
dtype: object 0       1
1      aa
2    2.34
3       d
dtype: object

In [13]:
dat5 = pd.Series([1,3,6,12], index=[1, 10, 20, 33])
dat6 = pd.Series([1,3,6,12], index=['a','b','c','a'])
dat7 = pd.Series({'a': 1, 'b':3, 'c':6, 'd':12})
print(dat5)
print(dat6)
print(dat7)

1      1
10     3
20     6
33    12
dtype: int64
a     1
b     3
c     6
a    12
dtype: int64
a     1
b     3
c     6
d    12
dtype: int64

In [17]:
dat2.index = ['un', 'deux', 'trois', 'quatre']
print(dat2)

un         1.0
deux       3.0
trois      NaN
quatre    12.0
dtype: float64

In [19]:
#딕셔너리 생성(키: 아이템명, 값: 데이터 프레임)
data = {'Item1': pd.DataFrame(np.random.randn(3,2)), 
        'Item2': pd.DataFrame(np.random.randn(3,2))}

#위에서 만든 딕셔너리로 패널을 생성한 다음, 이 패널의 내용을 화면에 표시
pp1 = pd.Panel(data);
pp1

<class 'pandas.core.panel.Panel'>
Dimensions: 2 (items) x 3 (major_axis) x 2 (minor_axis)
Items axis: Item1 to Item2
Major_axis axis: 0 to 2
Minor_axis axis: 0 to 1

In [20]:
pp2 = pd.Panel(np.random.randn(2, 4, 3), items=['Item1', 'Item2'], 
                major_axis=pd.date_range('2/1/2016',periods=4),
                minor_axis=['one','two','three'])
pp2

<class 'pandas.core.panel.Panel'>
Dimensions: 2 (items) x 4 (major_axis) x 3 (minor_axis)
Items axis: Item1 to Item2
Major_axis axis: 2016-02-01 00:00:00 to 2016-02-04 00:00:00
Minor_axis axis: one to three

In [21]:
print(pp2.major_axis)
print(pp2.Item1.index)
print(pp2.major_axis is pp2.Item1.index)

DatetimeIndex(['2016-02-01', '2016-02-02', '2016-02-03', '2016-02-04'], dtype='datetime64[ns]', freq='D')
DatetimeIndex(['2016-02-01', '2016-02-02', '2016-02-03', '2016-02-04'], dtype='datetime64[ns]', freq='D')
True

In [25]:
data_frame = pd.DataFrame({
        "Age" : [20, 30, 45, 25, 31],
        "Height" : [180, 170, 160, 150, 140],
        "Sex" : ["m", "m", "f", "f", "f"]
})

#Age 열만 출력
print(data_frame["Age"])

0    20
1    30
2    45
3    25
4    31
Name: Age, dtype: int64

In [26]:
data_frame = pd.DataFrame(data, index = ['row1', 'row2'], columns = ['col1', 'col2'])

In [27]:
data_frame.index

Index(['row1', 'row2'], dtype='object')

In [28]:
data_frame.columns

Index(['col1', 'col2'], dtype='object')

In [29]:
data_frame.columns = ['new_col1', 'new_col2']

In [30]:
data_frame = pd.DataFrame({
        "Age" : [20, 30, 45, 25, 31],
        "Height" : [180, 170, 160, 150, 140],
        "Sex" : ["m", "m", "f", "f", "f"]
})

#Age, Height 열만 출력
print(data_frame[["Age", "Height"]])

   Age  Height
0   20     180
1   30     170
2   45     160
3   25     150
4   31     140

In [31]:
#data_frame의 1행만 추출
print(data_frame.iloc[1])
print(data_frame[1:2])

Age        30
Height    170
Sex         m
Name: 1, dtype: object
   Age  Height Sex
1   30     170   m

In [32]:
#data_frame에서 2행부터 3행까지 추출
print(data_frame.loc[2:3])
print(data_frame[2:4])

   Age  Height Sex
2   45     160   f
3   25     150   f
   Age  Height Sex
2   45     160   f
3   25     150   f

In [33]:
#data_frame에서 1행부터 끝까지 추출
print(data_frame[1:])

   Age  Height Sex
1   30     170   m
2   45     160   f
3   25     150   f
4   31     140   f

In [35]:
#by는 기준 열을 나타내며, ascending은 오름차순 여부를 나타낸다. 
data_frame = data_frame.sort_values(by = "Age", ascending=False)
print(data_frame)

   Age  Height Sex
2   45     160   f
4   31     140   f
1   30     170   m
3   25     150   f
0   20     180   m

In [36]:
#Height의 2행 출력
print(data_frame.loc[2, "Height"])

160

In [37]:
#Sex의 4행 출력
print(data_frame.loc[4, "Sex"])

f

In [38]:
#Height의 1행부터 3행까지 출력
print(data_frame.loc[1:3, "Height"])

1    170
3    150
Name: Height, dtype: int64

In [39]:
#Age의 0행과 2행 그리고 4행을 출력
print(data_frame.loc[[0,2,4],"Age"])

0    20
2    45
4    31
Name: Age, dtype: int64

In [40]:
#Age가 30 이하인 데이터만 추출
print(data_frame[data_frame["Age"] <= 30])

   Age  Height Sex
1   30     170   m
3   25     150   f
0   20     180   m

In [43]:
#Age가 30 이하이고 25이상인 데이터만 추출
print(data_frame[(data_frame["Age"] <= 30) & (data_frame["Age"] >= 25)])

   Age  Height Sex
1   30     170   m
3   25     150   f

In [44]:
#Height이 180인 데이터만 추출
print(data_frame[data_frame["Height"] == 180])

   Age  Height Sex
0   20     180   m

In [45]:
data_frame["Weight"] = [50, 60, 70, 80, 90]
print(data_frame)

   Age  Height Sex  Weight
2   45     160   f      50
4   31     140   f      60
1   30     170   m      70
3   25     150   f      80
0   20     180   m      90

In [48]:
data_frame.loc[len(data_frame)] = [15, 150, "m", None]
print(data_frame)

   Age  Height Sex Weight
2   45     160   f     50
4   31     140   f     60
1   30     170   m     70
3   25     150   f     80
0   20     180   m     90
5   15     150   m   None

In [49]:
#Height 열을 삭제
print(data_frame.drop(["Height"],axis=1))

   Age Sex Weight
2   45   f     50
4   31   f     60
1   30   m     70
3   25   f     80
0   20   m     90
5   15   m   None

In [50]:
#3행을 삭제
print(data_frame.drop(3,axis=0))

   Age  Height Sex Weight
2   45     160   f     50
4   31     140   f     60
1   30     170   m     70
0   20     180   m     90
5   15     150   m   None

In [51]:
#data_frame을 수직으로 연결
new_data_frame = pd.concat([data_frame, data_frame],axis=0)
print(new_data_frame)

   Age  Height Sex Weight
2   45     160   f     50
4   31     140   f     60
1   30     170   m     70
3   25     150   f     80
0   20     180   m     90
5   15     150   m   None
2   45     160   f     50
4   31     140   f     60
1   30     170   m     70
3   25     150   f     80
0   20     180   m     90
5   15     150   m   None

In [52]:
#data_frame을 수평으로 연결
new_data_frame = pd.concat([data_frame, data_frame],axis=1)
print(new_data_frame)

   Age  Height Sex Weight  Age  Height Sex Weight
2   45     160   f     50   45     160   f     50
4   31     140   f     60   31     140   f     60
1   30     170   m     70   30     170   m     70
3   25     150   f     80   25     150   f     80
0   20     180   m     90   20     180   m     90
5   15     150   m   None   15     150   m   None

In [53]:
#data_frame의 Age의 합과 평균, 최대, 최소를 구함
print("평균 :", data_frame["Age"].mean())
print("합 : ", data_frame["Age"].sum())
print("최대 : ", data_frame["Age"].max())
print("최소 : ", data_frame["Age"].min())

평균 : 27.666666666666668
합 :  166
최대 :  45
최소 :  15

#### EXAMPLE 1

In [55]:
male_data_frame = data_frame[data_frame["Sex"]=="m"]
female_data_frame = data_frame[data_frame["Sex"]=="f"]

smale_data_frame = male_data_frame[data_frame["Age"]>=30]
sfemale_data_frame = female_data_frame[data_frame["Age"]>=30]

print("답 : ", smale_data_frame["Height"].mean())
print("답 : ", sfemale_data_frame["Height"].mean())

답 :  170.0
답 :  150.0

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:5: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """
C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:6: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

#### EXAMPLE 2

<br> 프로듀스 회사의 근무자, 성별, 근무지, 연봉이 기록된 <br>“Produce.xlsx”에서 다음과 같은 질문에 답해보도록 하자.

1) 이름이 김사랑, 성별 F, 근무지 CICAGO, 연봉 6000인 직원을 추가하라.
<br>
2) 성별이 M이면 1, 성별이 F이면 0인 Sex 열을 추가하고, 성별 열을 제거하라.
<br>
3) 근무지별, 성별 평균 연봉을 구해라.
<br>
4) 성별이 M이고 SEOUL에서 일하는 사람들의 평균 연봉을 구해라.
<br>
5) 연봉이 5000이상인 사람들 중 여성의 비율을 구하여라.`

In [56]:
data_frame = pd.read_excel("Produce.xlsx", sheet_name = "Sheet1")
print(data_frame)

        이름 성별     근무지  연봉(만원)
0     강다니엘  M   SEOUL    5419
1      강동호  M  CICAGO    6443
2      강미나  F   SEOUL     445
3      권현빈  M      LA    1199
4      김도연  F  CICAGO    7579
5     김사무엘  M   SEOUL     290
6      김세정  F  CICAGO    4113
7      김소혜  F   SEOUL    1200
8      김청하  F   SEOUL    5447
9      노태현  M  CICAGO    3126
10    라이관린  M      LA    6890
11     박우진  M      LA    2371
12     박지훈  M   SEOUL    7980
13     배진영  M  CICAGO    8399
14     옹성우  M   SEOUL    2477
15     유연정  F   SEOUL    8474
16     임나영  F   SEOUL    6732
17     전소미  F      LA    9828
18     정채연  F   SEOUL    2208
19     주결경  F   SEOUL    7373
20     주학년  M  CICAGO    1379
21     최유정  F      LA    7137
22  타카다 켄타  M      LA    4091
23     하성운  M  CICAGO    8721

In [58]:
# 1) 이름이 김사랑, 성별 F, 근무지 CICAGO, 연봉 6000인 직원을 추가하라
data_frame.loc[len(data_frame)] = ["김사랑", "F", "CICAGO", 6000]
print(data_frame)

        이름 성별     근무지  연봉(만원)
0     강다니엘  M   SEOUL    5419
1      강동호  M  CICAGO    6443
2      강미나  F   SEOUL     445
3      권현빈  M      LA    1199
4      김도연  F  CICAGO    7579
5     김사무엘  M   SEOUL     290
6      김세정  F  CICAGO    4113
7      김소혜  F   SEOUL    1200
8      김청하  F   SEOUL    5447
9      노태현  M  CICAGO    3126
10    라이관린  M      LA    6890
11     박우진  M      LA    2371
12     박지훈  M   SEOUL    7980
13     배진영  M  CICAGO    8399
14     옹성우  M   SEOUL    2477
15     유연정  F   SEOUL    8474
16     임나영  F   SEOUL    6732
17     전소미  F      LA    9828
18     정채연  F   SEOUL    2208
19     주결경  F   SEOUL    7373
20     주학년  M  CICAGO    1379
21     최유정  F      LA    7137
22  타카다 켄타  M      LA    4091
23     하성운  M  CICAGO    8721
24     김사랑  F  CICAGO    6000

In [59]:
# 2) 성별이 M이면 1, 성별이 F이면 0인 Sex 열을 추가하고, 성별 열을 제거하라
data_frame["Sex"] = (data_frame["성별"] == "M")*1
data_frame = data_frame.drop(["성별"],axis=1)
print(data_frame)

        이름     근무지  연봉(만원)  Sex
0     강다니엘   SEOUL    5419    1
1      강동호  CICAGO    6443    1
2      강미나   SEOUL     445    0
3      권현빈      LA    1199    1
4      김도연  CICAGO    7579    0
5     김사무엘   SEOUL     290    1
6      김세정  CICAGO    4113    0
7      김소혜   SEOUL    1200    0
8      김청하   SEOUL    5447    0
9      노태현  CICAGO    3126    1
10    라이관린      LA    6890    1
11     박우진      LA    2371    1
12     박지훈   SEOUL    7980    1
13     배진영  CICAGO    8399    1
14     옹성우   SEOUL    2477    1
15     유연정   SEOUL    8474    0
16     임나영   SEOUL    6732    0
17     전소미      LA    9828    0
18     정채연   SEOUL    2208    0
19     주결경   SEOUL    7373    0
20     주학년  CICAGO    1379    1
21     최유정      LA    7137    0
22  타카다 켄타      LA    4091    1
23     하성운  CICAGO    8721    1
24     김사랑  CICAGO    6000    0

In [60]:
# 3) 근무지별, 성별 평균 연봉을 구해라.
print("조건별 평균 연봉")
print("LA : " , data_frame[data_frame["근무지"] =="LA"]["연봉(만원)"].mean())
print("SEOUL : " , data_frame[data_frame["근무지"] =="SEOUL"]["연봉(만원)"].mean())
print("CICAGO : " , data_frame[data_frame["근무지"] =="CICAGO"]["연봉(만원)"].mean())
print("남자 : " , data_frame[data_frame["Sex"] == 1]["연봉(만원)"].mean())
print("여자 : " , data_frame[data_frame["Sex"] == 0]["연봉(만원)"].mean())

조건별 평균 연봉
LA :  5252.666666666667
SEOUL :  4367.727272727273
CICAGO :  5720.0
남자 :  4521.923076923077
여자 :  5544.666666666667

In [61]:
# 4) 성별이 M이고 SEOUL에서 일하는 사람들의 평균 연봉을 구해라.
print(data_frame[(data_frame["Sex"]==1) & (data_frame["근무지"]=="SEOUL")]["연봉(만원)"].mean())

4041.5

In [62]:
# 5) 연봉이 5000이상인 사람들 중 여성의 비율을 구하여라.
print("연봉 5000이 넘는 직원의 수 : ",len(data_frame[(data_frame["연봉(만원)"]>5000)]))

연봉 5000이 넘는 직원의 수 :  14

In [63]:
print("연봉 5000이 넘는 여성의 비율 : ", 1 - data_frame[(data_frame["연봉(만원)"]>5000)]["Sex"].mean())

연봉 5000이 넘는 여성의 비율 :  0.5714285714285714

#### Syn with Numpy

In [69]:
#random한 3행 4열의 DataFrame 생성
data_frame = pd.DataFrame(np.random.randn(3, 4))
data_frame

          0         1         2         3
0 -0.244956  0.396614  0.324142 -0.769038
1 -0.527902  0.232046  0.802817 -0.296696
2 -0.245804  0.065968  1.260086  0.475873

In [65]:
#data_frame의 모든 원소에 log 값을 취함
new_data_frame = np.log(data_frame)

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: RuntimeWarning: invalid value encountered in log

In [66]:
#data_frame을 ndarray로 변환
nparray = np.array(data_frame)

In [67]:
data_frame.dropna()

          0         1         2         3
0  1.446396  1.421066 -0.150473 -1.352131
1  1.254256 -0.487026  1.139824 -0.347552
2 -0.589183  0.432515 -1.918088 -0.167815

In [68]:
data_frame.dropna(axis=1)

          0         1         2         3
0  1.446396  1.421066 -0.150473 -1.352131
1  1.254256 -0.487026  1.139824 -0.347552
2 -0.589183  0.432515 -1.918088 -0.167815

#### Dealing with NaN data

In [77]:
# #col1, col2 열에 NaN이 포함된 행을 삭제
# data_frame.dropna(subset=['col1', 'col2'])

# #3행과 5행에 NaN이 포함된 열을 삭제
# data_frame.dropna(axis=1, subset=[3, 5])

# #모든 NaN을 0으로 치환한다
# data_frame.fillna(0)

# data_frame.isnull()

# #NaN을 같은 열의 바로 위의 행 값으로 대체 f for forward
# data_frame.fillna(method = 'ffill')

# #NaN을 같은 열의 바로 아래 행 값으로 대체
# data_frame.fillna(method = 'bfill')